### Pandas Tutorial
Pandas is an open source, BSD-liscensed library providing high-performance, easy to use data structure and data analysis tools for the Python programming language.

- What is Data Frames?
- What is Data Series ?
- Different operation in Pandas

In [3]:
# First step is to import pandas

import pandas as pd
import numpy as np

In [9]:
# Playing with Dataframe
#Suppose we are given CSV files or excel sheets mein data
#now suppose we have to read that data toh we will use Pandas
#Pandas will load the data and once data is loaded then data gets converted into Dataframe
#DataFrame is a combination of cols and rows
#Now we are creating dataframe

#First parameter in dataframe is data and it is 2d since we get data in form of excel sheet
#Index is row index values
#Columns are col index values

df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['Column1','Column2','Column3','Column4'])
#Index must be given based on number of rows 
#since here we have 5 rows so 5 row index we have given
#col and row indexing is imp so that we can retrieve values and it become easy to retrieve values

In [13]:
df.head() #basically below is the way the jaisa hamara data excel sheet mein dikhega

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [17]:
df.to_csv('Python-5_excel.c') #converted the dataframe into excel sheet

#### 1. Accessing the elements

In [20]:
# 1. loc is label based means we have to specify the name of rows and columns that we need to filter out
# 2. iloc is index-based means specify rows and columns by their integer index

In [24]:
df.loc['Row1'] #picks up row1

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [28]:
type(df.loc['Row1']) #the type is series
#dataframe is combination of many rows and cols , it should be greater than 1 row and greater than 1 col
# series can be any 1 row or any 1 col

pandas.core.series.Series

In [30]:
df.iloc[:,:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [32]:
#take elements from col 2
df.iloc[:,1:]

      Column2  Column3  Column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [36]:
#suppose i want 2 rows
df.iloc[0:2,:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7

In [40]:
type(df.iloc[0:2,:]) #aab iska type will be dataframe

pandas.core.frame.DataFrame

In [42]:
df.iloc[0:2,0:1]

      Column1
Row1        0
Row2        4

In [44]:
#the above is also dataframe since we have we have more than 1 col
type(df.iloc[0:2,0:1])

pandas.core.frame.DataFrame

In [48]:
df.iloc[0:2,0] #u can see now this is series since there is 1 col and that col doesnt have a heading
#when heading is mssing then its series

Row1    0
Row2    4
Name: Column1, dtype: int32

In [50]:
type(df.iloc[0:2,0])

pandas.core.series.Series

In [52]:
#take elements from col 2
df.iloc[:,1:]

      Column2  Column3  Column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [79]:
#U can also directly call using col name
df['Column3']

Row1     2
Row2     6
Row3    10
Row4    14
Row5    18
Name: Column3, dtype: int32

In [81]:
type(df['Column3'])

pandas.core.series.Series

In [85]:
df[['Column3','Column4']] #when u want multiple cols then u should create a list

      Column3  Column4
Row1        2        3
Row2        6        7
Row3       10       11
Row4       14       15
Row5       18       19

#### 2. Converting Dataframes into Array

In [58]:
df.iloc[:,1:].values #when dataframes are converted into arrays then its just going to skip col and row indexs

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [60]:
df.iloc[:,1:].values.shape

(5, 3)

### 3. How to check the null condition

In [65]:
df.isnull().sum() #basically number of null values in each col

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

#### 4. Value_counts()

In [68]:
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [72]:
#suppose in col 1 we have categorial features and i want to check how many unique catergories do we have
df['Column1'].value_counts()
#this will givve like 0 is present 1 time, 4 is present 1 time and so on

Column1
0     1
4     1
8     1
12    1
16    1
Name: count, dtype: int64

#### 5. Unique Function

In [77]:
df['Column1'].unique() #shows all the unique values and doesnt show the unique value

array([ 0,  4,  8, 12, 16])